f32c/arduino/hardware/fpga/f32c/tools/boards-manager/boards.txt
menu.cpu=CPU Architecture
menu.speed=CPU Speed
menu.ramsize=RAM Size
menu.protocol=Protocol
menu.pinmap=PIN Map
menu.bitstream=Upload Bitstream to
menu.soc=SOC
menu.fpga=FPGA
menu.jtag=OpenOCD JTAG
menu.model=Model

#
# FPGArduino ULX2S f32c SoC SRAM
#
fpga_ulx2s_sram.name=FER ULX2S (Lattice XP2, 1M SRAM, 81.25 MHz)
fpga_ulx2s_sram.compiler.ld.extra_flags=--section-start=.init=0x80000000
fpga_ulx2s_sram.build.variant=generic
fpga_ulx2s_sram.build.mcu=f32c
fpga_ulx2s_sram.build.core=f32c
fpga_ulx2s_sram.build.board=F32C_FPGA_ULX2S_SRAM
fpga_ulx2s_sram.build.soc_video_bpp=8
fpga_ulx2s_sram.build.sdata.size=4096
fpga_ulx2s_sram.upload.tool=ujprog
fpga_ulx2s_sram.upload.wait_for_upload_port=false
fpga_ulx2s_sram.upload.native_usb=false
fpga_ulx2s_sram.upload.maximum_size=1015808
fpga_ulx2s_sram.upload.bitstream.command="{cmd.path}" -j {ujprog_target} "{runtime.tools.bootloaders.path}/{bootloader.file}"
fpga_ulx2s_sram.bootloader.file=ulx2s/ulx2s_{chip}_mips_sram{socopt}{f_cpu_MHz}mhz.jed
fpga_ulx2s_sram.menu.cpu.mips=MIPS
fpga_ulx2s_sram.menu.cpu.mips.cpu.arch=mips
fpga_ulx2s_sram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_ulx2s_sram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_ulx2s_sram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_ulx2s_sram.menu.fpga.8e=8E
fpga_ulx2s_sram.menu.fpga.8e.chip=8e
fpga_ulx2s_sram.menu.fpga.5e=5E
fpga_ulx2s_sram.menu.fpga.5e.chip=5e
fpga_ulx2s_sram.menu.soc.normal=Normal (TV, 29 GPIO, 81 MHz)
fpga_ulx2s_sram.menu.soc.normal.socopt=_tv_
fpga_ulx2s_sram.menu.soc.normal.build.f_cpu=81250000
fpga_ulx2s_sram.menu.soc.normal.f_cpu_MHz=81
fpga_ulx2s_sram.menu.soc.minimal=Minimal (29 GPIO, 81 MHz)
fpga_ulx2s_sram.menu.soc.minimal.socopt=_minimal_
fpga_ulx2s_sram.menu.soc.minimal.build.f_cpu=81250000
fpga_ulx2s_sram.menu.soc.minimal.f_cpu_MHz=81
fpga_ulx2s_sram.menu.soc.fm=Radio (87-108MHz FM/RDS, 28 GPIO, 81 MHz)
fpga_ulx2s_sram.menu.soc.fm.socopt=_fm_
fpga_ulx2s_sram.menu.soc.fm.build.f_cpu=81250000
fpga_ulx2s_sram.menu.soc.fm.f_cpu_MHz=81
fpga_ulx2s_sram.menu.soc.433M92_25M=Remote std (433.92MHz, 28 GPIO, 25 MHz)
fpga_ulx2s_sram.menu.soc.433M92_25M.socopt=_433M92_
fpga_ulx2s_sram.menu.soc.433M92_25M.build.f_cpu=25000000
fpga_ulx2s_sram.menu.soc.433M92_25M.f_cpu_MHz=25
fpga_ulx2s_sram.menu.soc.433M92_56M=Remote std (433.92MHz, 28 GPIO, 56 MHz)
fpga_ulx2s_sram.menu.soc.433M92_56M.socopt=_433M92_
fpga_ulx2s_sram.menu.soc.433M92_56M.build.f_cpu=56250000
fpga_ulx2s_sram.menu.soc.433M92_56M.f_cpu_MHz=56
fpga_ulx2s_sram.menu.soc.433M33=Remote spec (433.33MHz, 28 GPIO, 81 MHz)
fpga_ulx2s_sram.menu.soc.433M33.socopt=_433M33_
fpga_ulx2s_sram.menu.soc.433M33.build.f_cpu=81250000
fpga_ulx2s_sram.menu.soc.433M33.f_cpu_MHz=81
fpga_ulx2s_sram.menu.soc.pid=DC Motors (PID, 16 GPIO, 81 MHz)
fpga_ulx2s_sram.menu.soc.pid.socopt=_pid_
fpga_ulx2s_sram.menu.soc.pid.build.f_cpu=81250000
fpga_ulx2s_sram.menu.soc.pid.f_cpu_MHz=81
fpga_ulx2s_sram.menu.soc.vgabit=Video 640x480 (VGA, 16 GPIO, 50 MHz)
fpga_ulx2s_sram.menu.soc.vgabit.socopt=_vgabit_
fpga_ulx2s_sram.menu.soc.vgabit.build.f_cpu=50000000
fpga_ulx2s_sram.menu.soc.vgabit.f_cpu_MHz=50
fpga_ulx2s_sram.menu.soc.vgatxt80x30=Video text 80x30+640x480 (VGA, 16 GPIO, 50 MHz)
fpga_ulx2s_sram.menu.soc.vgatxt80x30.socopt=_vgatxt80x30_
fpga_ulx2s_sram.menu.soc.vgatxt80x30.build.f_cpu=50000000
fpga_ulx2s_sram.menu.soc.vgatxt80x30.f_cpu_MHz=50
fpga_ulx2s_sram.menu.soc.vgatxt80x60=Video text 80x60+640x480 (VGA, 16 GPIO, 50 MHz)
fpga_ulx2s_sram.menu.soc.vgatxt80x60.socopt=_vgatxt80x60_
fpga_ulx2s_sram.menu.soc.vgatxt80x60.build.f_cpu=50000000
fpga_ulx2s_sram.menu.soc.vgatxt80x60.f_cpu_MHz=50
fpga_ulx2s_sram.menu.soc.hdmibit=Video 640x480 (HDMI, 16 GPIO, 50 MHz)
fpga_ulx2s_sram.menu.soc.hdmibit.socopt=_hdmibit_
fpga_ulx2s_sram.menu.soc.hdmibit.build.f_cpu=50000000
fpga_ulx2s_sram.menu.soc.hdmibit.f_cpu_MHz=50
#fpga_ulx2s_sram.menu.soc.hdmitxt80x30=Video text 80x30+640x480 (HDMI, 16 GPIO, 50 MHz)
#fpga_ulx2s_sram.menu.soc.hdmitxt80x30.socopt=_hdmitxt80x30_
#fpga_ulx2s_sram.menu.soc.hdmitxt80x30.build.f_cpu=50000000
#fpga_ulx2s_sram.menu.soc.hdmitxt80x30.f_cpu_MHz=50
#fpga_ulx2s_sram.menu.soc.hdmitxt80x60=Video text 80x60+640x480 (HDMI, 16 GPIO, 50 MHz)
#fpga_ulx2s_sram.menu.soc.hdmitxt80x60.socopt=_hdmitxt80x60_
#fpga_ulx2s_sram.menu.soc.hdmitxt80x60.build.f_cpu=50000000
#fpga_ulx2s_sram.menu.soc.hdmitxt80x60.f_cpu_MHz=50
fpga_ulx2s_sram.menu.soc.ledstrip=Video 50x72 (LEDSTRIP, 16 GPIO, 81 MHz)
fpga_ulx2s_sram.menu.soc.ledstrip.socopt=_ledstrip_
fpga_ulx2s_sram.menu.soc.ledstrip.build.f_cpu=81250000
fpga_ulx2s_sram.menu.soc.ledstrip.f_cpu_MHz=81
fpga_ulx2s_sram.menu.protocol.binftdi=Binary 3 Mbit/s CRC FTDI
fpga_ulx2s_sram.menu.protocol.binftdi.upload.protocol=bin
fpga_ulx2s_sram.menu.protocol.binftdi.upload.flags=-re
fpga_ulx2s_sram.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_ulx2s_sram.menu.protocol.bin.upload.protocol=bin
fpga_ulx2s_sram.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_ulx2s_sram.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_ulx2s_sram.menu.protocol.hex.upload.protocol=hex
fpga_ulx2s_sram.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_ulx2s_sram.menu.bitstream.ujprog_sram=SRAM ujprog (temporary)
fpga_ulx2s_sram.menu.bitstream.ujprog_sram.ujprog_target=sram
fpga_ulx2s_sram.menu.bitstream.ujprog_flash=FLASH ujprog (permanent)
fpga_ulx2s_sram.menu.bitstream.ujprog_flash.ujprog_target=flash

#
# FPGArduino ULX2S f32c SoC BRAM
#
fpga_ulx2s_bram.name=FER ULX2S (Lattice XP2, 16K BRAM, 81.25 MHz)
fpga_ulx2s_bram.build.f_cpu=81250000
fpga_ulx2s_bram.build.variant=generic
fpga_ulx2s_bram.build.mcu=f32c
fpga_ulx2s_bram.build.core=f32c
fpga_ulx2s_bram.build.board=F32C_FPGA_ULX2S_BRAM
fpga_ulx2s_bram.build.soc_video_bpp=8
fpga_ulx2s_bram.upload.tool=ujprog
fpga_ulx2s_bram.upload.wait_for_upload_port=false
fpga_ulx2s_bram.upload.native_usb=false
fpga_ulx2s_bram.upload.maximum_size=14848
fpga_ulx2s_bram.upload.bitstream.command="{cmd.path}" -j SRAM "{runtime.tools.bootloaders.path}/{bootloader.file}"
fpga_ulx2s_bram.bootloader.file=ulx2s/ulx2s_8e_{cpu.arch}_bram{socopt}{f_cpu_MHz}mhz.jed
fpga_ulx2s_bram.menu.cpu.mips=MIPS
fpga_ulx2s_bram.menu.cpu.mips.cpu.arch=mips
fpga_ulx2s_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_ulx2s_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_ulx2s_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_ulx2s_bram.menu.cpu.riscv=RISC-V
fpga_ulx2s_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_ulx2s_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_ulx2s_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_ulx2s_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_ulx2s_bram.menu.soc.normal=Normal (29 GPIO, 81.25MHz)
fpga_ulx2s_bram.menu.soc.normal.socopt=_
fpga_ulx2s_bram.menu.soc.normal.build.f_cpu=81250000
fpga_ulx2s_bram.menu.soc.normal.f_cpu_MHz=81
fpga_ulx2s_bram.menu.soc.pid=Special (PID, 16 GPIO, 81.25MHz)
fpga_ulx2s_bram.menu.soc.pid.socopt=_pid_
fpga_ulx2s_bram.menu.soc.pid.build.f_cpu=81250000
fpga_ulx2s_bram.menu.soc.pid.f_cpu_MHz=81
fpga_ulx2s_bram.menu.soc.tx433=433.92MHz (433.92MHz, 16 GPIO, 25MHz)
fpga_ulx2s_bram.menu.soc.tx433.socopt=_433_
fpga_ulx2s_bram.menu.soc.tx433.build.f_cpu=25000000
fpga_ulx2s_bram.menu.soc.tx433.f_cpu_MHz=25
fpga_ulx2s_bram.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_ulx2s_bram.menu.protocol.bin.upload.protocol=bin
fpga_ulx2s_bram.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_ulx2s_bram.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_ulx2s_bram.menu.protocol.hex.upload.protocol=hex
fpga_ulx2s_bram.menu.protocol.hex.upload.flags=-P{serial.port} -ra

#
# Lattice FleaFPGA-Uno (Fleasystems Lattice MachXO2-7000HC)
# http://www.fleasystems.com
#
fpga_fleafpga_uno.name=FleaFPGA-Uno (Lattice MachXO2-7000HC)
fpga_fleafpga_uno.build.board=F32C_FPGA_FLEAFPGA_UNO
fpga_fleafpga_uno.build.f_cpu=50000000
fpga_fleafpga_uno.build.variant=generic
fpga_fleafpga_uno.build.mcu=f32c
fpga_fleafpga_uno.build.core=f32c
fpga_fleafpga_uno.build.soc_video_bpp=8
fpga_fleafpga_uno.upload.tool=ujprog
fpga_fleafpga_uno.upload.wait_for_upload_port=false
fpga_fleafpga_uno.upload.native_usb=false
fpga_fleafpga_uno.upload.maximum_size=491520
fpga_fleafpga_uno.upload.bitstream.command="{runtime.tools.FleaFPGA-JTAG.path}/FleaFPGA-JTAG" "{bootloader.file.vme}"
fpga_fleafpga_uno.bootloader.file.vme={runtime.tools.bootloaders.path}/FleaFPGA-Uno/FleaFPGA-Uno_{cpu.arch}_{bitstream_target}_{socopt}_{f_cpu_MHz}mhz.vme
fpga_fleafpga_uno.menu.cpu.mips=MIPS
fpga_fleafpga_uno.menu.cpu.mips.cpu.arch=mips
fpga_fleafpga_uno.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_fleafpga_uno.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_fleafpga_uno.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_fleafpga_uno.menu.cpu.riscv=RISC-V
fpga_fleafpga_uno.menu.cpu.riscv.cpu.arch=riscv
fpga_fleafpga_uno.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_fleafpga_uno.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_fleafpga_uno.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_fleafpga_uno.menu.ramsize.512K=512KB SRAM Onboard
fpga_fleafpga_uno.menu.ramsize.512K.upload.maximum_size=491520
fpga_fleafpga_uno.menu.ramsize.512K.build.sdata.size=4096
fpga_fleafpga_uno.menu.ramsize.512K.compiler.ld.extra_flags=--section-start=.init=0x80000000
fpga_fleafpga_uno.menu.ramsize.16K=16KB BRAM Internal
fpga_fleafpga_uno.menu.ramsize.16K.upload.maximum_size=14900
fpga_fleafpga_uno.menu.ramsize.16K.build.sdata.size=32768
fpga_fleafpga_uno.menu.ramsize.16K.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_fleafpga_uno.menu.soc.vgatxt80x30=text 80x30-8x8 640x480-8bpp (HDMI, 50 MHz)
fpga_fleafpga_uno.menu.soc.vgatxt80x30.socopt=vgatxt80x30
fpga_fleafpga_uno.menu.soc.vgatxt80x30.build.f_cpu=50000000
fpga_fleafpga_uno.menu.soc.vgatxt80x30.f_cpu_MHz=50
fpga_fleafpga_uno.menu.soc.vgatxt80x60=text 80x60-8x8 640x480-8bpp (HDMI, 50 MHz)
fpga_fleafpga_uno.menu.soc.vgatxt80x60.socopt=vgatxt80x60
fpga_fleafpga_uno.menu.soc.vgatxt80x60.build.f_cpu=50000000
fpga_fleafpga_uno.menu.soc.vgatxt80x60.f_cpu_MHz=50
fpga_fleafpga_uno.menu.soc.vgabit640x480=640x480-8bpp (HDMI, 50 MHz)
fpga_fleafpga_uno.menu.soc.vgabit640x480.socopt=vgabit640x480
fpga_fleafpga_uno.menu.soc.vgabit640x480.build.f_cpu=50000000
fpga_fleafpga_uno.menu.soc.vgabit640x480.f_cpu_MHz=50
fpga_fleafpga_uno.menu.soc.vgabit800x480=800x480-8bpp (HDMI, 50 MHz)
fpga_fleafpga_uno.menu.soc.vgabit800x480.socopt=vgabit800x480
fpga_fleafpga_uno.menu.soc.vgabit800x480.build.f_cpu=50000000
fpga_fleafpga_uno.menu.soc.vgabit800x480.f_cpu_MHz=50
fpga_fleafpga_uno.menu.soc.vgabit800x600=800x600-8bpp (HDMI, 50 MHz)
fpga_fleafpga_uno.menu.soc.vgabit800x600.socopt=vgabit800x600
fpga_fleafpga_uno.menu.soc.vgabit800x600.build.f_cpu=50000000
fpga_fleafpga_uno.menu.soc.vgabit800x600.f_cpu_MHz=50
fpga_fleafpga_uno.menu.bitstream.sram=SRAM (temporary)
fpga_fleafpga_uno.menu.bitstream.sram.bitstream_target=sram
fpga_fleafpga_uno.menu.bitstream.flash=FLASH (permanent)
fpga_fleafpga_uno.menu.bitstream.flash.bitstream_target=flash
fpga_fleafpga_uno.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_fleafpga_uno.menu.protocol.bin.upload.protocol=bin
fpga_fleafpga_uno.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_fleafpga_uno.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_fleafpga_uno.menu.protocol.hex.upload.protocol=hex
fpga_fleafpga_uno.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_fleafpga_uno.menu.pinmap.FleaFPGA-Uno=FleaFPGA-Uno board
fpga_fleafpga_uno.menu.pinmap.FleaFPGA-Uno.build.variant=FleaFPGA-Uno
fpga_fleafpga_uno.menu.pinmap.generic=generic
fpga_fleafpga_uno.menu.pinmap.generic.build.variant=generic

#
# Mikroprojekt Kondor AX Lattice ECP5
#
fpga_kondor_ax.name=Mikroprojekt Kondor AX (Lattice ECP5 LFE5UM-85F-7, 128K ACRAM EMU, 100 MHz)
fpga_kondor_ax.build.mcu=f32c
fpga_kondor_ax.build.core=f32c
fpga_kondor_ax.build.board=F32C_FPGA_KONDOR_AX
fpga_kondor_ax.build.soc_video_bpp=8
fpga_kondor_ax.upload.tool=ujprog
fpga_kondor_ax.upload.wait_for_upload_port=false
fpga_kondor_ax.upload.native_usb=false
fpga_kondor_ax.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/kondor_ax.cfg
fpga_kondor_ax.bootloader.file.svf={runtime.tools.bootloaders.path}/kondor_ax/kondorax_{cpu.arch}_{memsupport}_{bitstream.fcpu.mhz}mhz.svf
fpga_kondor_ax.bootloader.openocd.command=svf -tap chip.tap {{bootloader.file.svf}}
fpga_kondor_ax.menu.cpu.mips=MIPS
fpga_kondor_ax.menu.cpu.mips.cpu.arch=mips
fpga_kondor_ax.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_kondor_ax.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_kondor_ax.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_kondor_ax.menu.cpu.riscv=RISC-V
fpga_kondor_ax.menu.cpu.riscv.cpu.arch=riscv
fpga_kondor_ax.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_kondor_ax.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_kondor_ax.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_kondor_ax.menu.ramsize.128=128 KB BRAM Emulated External
fpga_kondor_ax.menu.ramsize.128.upload.maximum_size=128000
fpga_kondor_ax.menu.ramsize.128.compiler.ld.extra_flags=--section-start=.init=0x80000000
fpga_kondor_ax.menu.ramsize.128.memsupport=acram_emu
fpga_kondor_ax.menu.speed.100=100 MHz
fpga_kondor_ax.menu.speed.100.build.f_cpu=100000000
fpga_kondor_ax.menu.speed.100.bitstream.fcpu.mhz=100
fpga_kondor_ax.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_kondor_ax.menu.protocol.bin.upload.protocol=bin
fpga_kondor_ax.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_kondor_ax.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_kondor_ax.menu.protocol.hex.upload.protocol=hex
fpga_kondor_ax.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_kondor_ax.menu.pinmap.generic=Generic
fpga_kondor_ax.menu.pinmap.generic.build.variant=generic
fpga_kondor_ax.menu.jtag.onboard=Onboard FT2232 USB-JTAG
fpga_kondor_ax.menu.jtag.onboard.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/ft2232-generic.cfg
fpga_kondor_ax.menu.bitstream.sram=SRAM openocd (temporary)
fpga_kondor_ax.menu.bitstream.sram.upload.bitstream.command={runtime.tools.openocd.path}/bin/openocd "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command={bootloader.openocd.command}" "--command=shutdown"

