f32c/arduino/hardware/fpga/f32c/tools/boards-manager/boards.txt
#
# Mikroprojekt Sparrowhawk FX Lattice ECP3
#
fpga_sparrowhawk.name=Mikroprojekt Sparrowhawk FX (Lattice ECP3 LFE3-150EA-8, 128K ACRAM EMU, 100 MHz)
fpga_sparrowhawk.build.mcu=f32c
fpga_sparrowhawk.build.core=f32c
fpga_sparrowhawk.build.board=F32C_FPGA_SPARROWHAWK
fpga_sparrowhawk.build.soc_video_bpp=8
fpga_sparrowhawk.upload.tool=ujprog
fpga_sparrowhawk.upload.wait_for_upload_port=false
fpga_sparrowhawk.upload.native_usb=false
fpga_sparrowhawk.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/sparrowhawk.cfg
fpga_sparrowhawk.bootloader.file.svf={runtime.tools.bootloaders.path}/sparrowhawk/sparrowhawk_{cpu.arch}_{memsupport}_{socopt}_{bitstream.fcpu.mhz}mhz.svf
fpga_sparrowhawk.bootloader.openocd.command=svf -tap chip.tap {{bootloader.file.svf}}
fpga_sparrowhawk.menu.cpu.mips=MIPS
fpga_sparrowhawk.menu.cpu.mips.cpu.arch=mips
fpga_sparrowhawk.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_sparrowhawk.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_sparrowhawk.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_sparrowhawk.menu.cpu.riscv=RISC-V
fpga_sparrowhawk.menu.cpu.riscv.cpu.arch=riscv
fpga_sparrowhawk.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_sparrowhawk.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_sparrowhawk.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_sparrowhawk.menu.ramsize.128=128 KB BRAM Emulated External
fpga_sparrowhawk.menu.ramsize.128.upload.maximum_size=128000
fpga_sparrowhawk.menu.ramsize.128.compiler.ld.extra_flags=--section-start=.init=0x80000000
fpga_sparrowhawk.menu.ramsize.128.memsupport=acram_emu
fpga_sparrowhawk.menu.soc.vgatxt80x30=text 80x30 bitmap 640x480 83 MHz
fpga_sparrowhawk.menu.soc.vgatxt80x30.socopt=vgatxt80x30
fpga_sparrowhawk.menu.soc.vgatxt80x30.build.soc_video_bpp=8
fpga_sparrowhawk.menu.soc.vgatxt80x30.build.f_cpu=83333333
fpga_sparrowhawk.menu.soc.vgatxt80x30.bitstream.fcpu.mhz=83
fpga_sparrowhawk.menu.soc.vgatxt80x60=text 80x60 bitmap 640x480 83 MHz
fpga_sparrowhawk.menu.soc.vgatxt80x60.socopt=vgatxt80x60
fpga_sparrowhawk.menu.soc.vgatxt80x60.build.soc_video_bpp=8
fpga_sparrowhawk.menu.soc.vgatxt80x60.build.f_cpu=83333333
fpga_sparrowhawk.menu.soc.vgatxt80x60.bitstream.fcpu.mhz=83
fpga_sparrowhawk.menu.soc.vgabit8bpp=bitmap 640x480 8bpp 83 MHz
fpga_sparrowhawk.menu.soc.vgabit8bpp.socopt=vga8bpp640x480
fpga_sparrowhawk.menu.soc.vgabit8bpp.build.soc_video_bpp=8
fpga_sparrowhawk.menu.soc.vgabit8bpp.build.f_cpu=83333333
fpga_sparrowhawk.menu.soc.vgabit8bpp.bitstream.fcpu.mhz=83
fpga_sparrowhawk.menu.soc.vector=Vector FPU 100 MHz
fpga_sparrowhawk.menu.soc.vector.socopt=vector
fpga_sparrowhawk.menu.soc.vector.build.soc_video_bpp=8
fpga_sparrowhawk.menu.soc.vector.build.f_cpu=100000000
fpga_sparrowhawk.menu.soc.vector.bitstream.fcpu.mhz=100
fpga_sparrowhawk.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_sparrowhawk.menu.protocol.bin.upload.protocol=bin
fpga_sparrowhawk.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_sparrowhawk.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_sparrowhawk.menu.protocol.hex.upload.protocol=hex
fpga_sparrowhawk.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_sparrowhawk.menu.pinmap.generic=Generic
fpga_sparrowhawk.menu.pinmap.generic.build.variant=generic
fpga_sparrowhawk.menu.jtag.fpu1=FT2232 PLDkit FPU1
fpga_sparrowhawk.menu.jtag.fpu1.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/fpu1.cfg
#fpga_sparrowhawk.menu.jtag.remotebitbang=Remote bitbang (TCP jtag:3335)
#fpga_sparrowhawk.menu.jtag.remotebitbang.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/remote_bitbang.cfg
fpga_sparrowhawk.menu.bitstream.sram=SRAM openocd (temporary)
fpga_sparrowhawk.menu.bitstream.sram.upload.bitstream.command={runtime.tools.openocd.path}/bin/openocd "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command={bootloader.openocd.command}" "--command=shutdown"


#
# Lattice Brevia / Brevia2
#
fpga_brevia_bram.name=Lattice Brevia boards (Lattice XP2, 16K BRAM, 81.25 MHz)
fpga_brevia_bram.build.f_cpu=81250000
fpga_brevia_bram.build.variant=generic
fpga_brevia_bram.build.mcu=f32c
fpga_brevia_bram.build.core=f32c
fpga_brevia_bram.build.board=F32C_FPGA_BREVIA_BRAM
fpga_brevia_bram.build.soc_video_bpp=8
fpga_brevia_bram.upload.tool=ujprog
fpga_brevia_bram.upload.wait_for_upload_port=false
fpga_brevia_bram.upload.native_usb=false
fpga_brevia_bram.upload.maximum_size=14848
fpga_brevia_bram.upload.protocol=hex
fpga_brevia_bram.upload.flags=-P{serial.port} -ra
fpga_brevia_bram.menu.cpu.mips=MIPS
fpga_brevia_bram.menu.cpu.mips.cpu.arch=mips
fpga_brevia_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_brevia_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_brevia_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_brevia_bram.menu.cpu.riscv=RISC-V
fpga_brevia_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_brevia_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_brevia_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_brevia_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}

#
# Terasic DE0-Nano
#
fpga_de0_nano_bram.name=Terasic DE0-Nano (Altera Cyclone-IV, 32K BRAM, 100 MHz)
fpga_de0_nano_bram.build.f_cpu=100000000
fpga_de0_nano_bram.build.variant=generic
fpga_de0_nano_bram.build.mcu=f32c
fpga_de0_nano_bram.build.core=f32c
fpga_de0_nano_bram.build.board=F32C_FPGA_DE0_NANO_BRAM
fpga_de0_nano_bram.build.soc_video_bpp=8
fpga_de0_nano_bram.upload.tool=ujprog
fpga_de0_nano_bram.upload.wait_for_upload_port=false
fpga_de0_nano_bram.upload.native_usb=false
fpga_de0_nano_bram.upload.maximum_size=31232
fpga_de0_nano_bram.upload.protocol=hex
fpga_de0_nano_bram.upload.flags=-P{serial.port} -ra
fpga_de0_nano_bram.menu.cpu.mips=MIPS
fpga_de0_nano_bram.menu.cpu.mips.cpu.arch=mips
fpga_de0_nano_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_de0_nano_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_de0_nano_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_de0_nano_bram.menu.cpu.riscv=RISC-V
fpga_de0_nano_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_de0_nano_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_de0_nano_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_de0_nano_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_de0_nano_bram.menu.ramsize.32K=32 KB BRAM Internal
fpga_de0_nano_bram.menu.ramsize.32K.upload.maximum_size=31232
fpga_de0_nano_bram.menu.ramsize.32K.build.sdata.size=32768
fpga_de0_nano_bram.menu.ramsize.32K.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_de0_nano_bram.menu.ramsize.32M=32 MB SDRAM Onboard
fpga_de0_nano_bram.menu.ramsize.32M.upload.maximum_size=33521664
fpga_de0_nano_bram.menu.ramsize.32M.build.sdata.size=4096
fpga_de0_nano_bram.menu.ramsize.32M.compiler.ld.extra_flags=--section-start=.init=0x80000000

#
# ReVerSE-U16 (Altera Cyclone-IV)
#
fpga_reverse_u16.name=ReVerSE-U16 (Altera Cyclone-IV, 16M SDRAM, 83.33 MHz)
#fpga_reverse_u16.build.f_cpu=83333333
fpga_reverse_u16.build.variant=generic
fpga_reverse_u16.build.mcu=f32c
fpga_reverse_u16.build.core=f32c
fpga_reverse_u16.build.board=F32C_FPGA_REVERSE_U16
fpga_reverse_u16.build.soc_video_bpp=8
fpga_reverse_u16.upload.tool=ujprog
fpga_reverse_u16.upload.wait_for_upload_port=false
fpga_reverse_u16.upload.native_usb=false
#fpga_reverse_u16.upload.maximum_size=31232
#fpga_reverse_u16.upload.protocol=hex
#fpga_reverse_u16.upload.flags=-P{serial.port} -ra
fpga_reverse_u16.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/reverse-u16.cfg
fpga_reverse_u16.bootloader.file.svf={runtime.tools.bootloaders.path}/reverse-u16/reverseu16_revc_sdram_{cpu.arch}_{socopt}_{bitstream.fcpu.mhz}mhz.svf
fpga_reverse_u16.bootloader.file.jic={runtime.tools.bootloaders.path}/reverse-u16/reverseu16_revc_sdram_{cpu.arch}_{socopt}_{bitstream.fcpu.mhz}mhz.jic
fpga_reverse_u16.bootloader.file.sof={runtime.tools.bootloaders.path}/reverse-u16/reverseu16_revc_sdram_{cpu.arch}_{socopt}_{bitstream.fcpu.mhz}mhz.sof
fpga_reverse_u16.bootloader.openocd.command=svf -tap chip.tap {{bootloader.file.svf}}
fpga_reverse_u16.menu.cpu.mips=MIPS
fpga_reverse_u16.menu.cpu.mips.cpu.arch=mips
fpga_reverse_u16.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_reverse_u16.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_reverse_u16.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_reverse_u16.menu.cpu.riscv=RISC-V
fpga_reverse_u16.menu.cpu.riscv.cpu.arch=riscv
fpga_reverse_u16.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_reverse_u16.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_reverse_u16.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_reverse_u16.menu.ramsize.16M=16 MB SDRAM Onboard
fpga_reverse_u16.menu.ramsize.16M.upload.maximum_size=16000000
fpga_reverse_u16.menu.ramsize.16M.build.sdata.size=4096
fpga_reverse_u16.menu.ramsize.16M.compiler.ld.extra_flags=--section-start=.init=0x80000000
fpga_reverse_u16.menu.ramsize.32K=32 KB BRAM Internal
fpga_reverse_u16.menu.ramsize.32K.upload.maximum_size=31232
fpga_reverse_u16.menu.ramsize.32K.build.sdata.size=32768
fpga_reverse_u16.menu.ramsize.32K.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_reverse_u16.menu.soc.vgabit8bpp640x480=640x480-8bpp 83 MHz
fpga_reverse_u16.menu.soc.vgabit8bpp640x480.socopt=vgabit8bpp640x480
fpga_reverse_u16.menu.soc.vgabit8bpp640x480.build.soc_video_bpp=8
fpga_reverse_u16.menu.soc.vgabit8bpp640x480.build.f_cpu=83333333
fpga_reverse_u16.menu.soc.vgabit8bpp640x480.bitstream.fcpu.mhz=83
fpga_reverse_u16.menu.soc.vgabit8bpp640x480_vector=640x480-8bpp 8-Vector FPU 83 MHz
fpga_reverse_u16.menu.soc.vgabit8bpp640x480_vector.socopt=vgabit8bpp640x480_vector
fpga_reverse_u16.menu.soc.vgabit8bpp640x480_vector.build.soc_video_bpp=8
fpga_reverse_u16.menu.soc.vgabit8bpp640x480_vector.build.f_cpu=83333333
fpga_reverse_u16.menu.soc.vgabit8bpp640x480_vector.bitstream.fcpu.mhz=83
fpga_reverse_u16.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_reverse_u16.menu.protocol.bin.upload.protocol=bin
fpga_reverse_u16.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_reverse_u16.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_reverse_u16.menu.protocol.hex.upload.protocol=hex
fpga_reverse_u16.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_reverse_u16.menu.jtag.alterablaster=Altera Blaster
fpga_reverse_u16.menu.jtag.alterablaster.bootloader.openocd.interface={runtime.tools.openocd.path}/scripts/interface/altera-usb-blaster.cfg
fpga_reverse_u16.menu.jtag.remotebitbang=Remote bitbang (TCP jtag:3335)
fpga_reverse_u16.menu.jtag.remotebitbang.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/remote_bitbang.cfg
fpga_reverse_u16.menu.jtag.fpu1=FT2232 PLDkit FPU1
fpga_reverse_u16.menu.jtag.fpu1.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/fpu1.cfg
fpga_reverse_u16.menu.bitstream.sram=SRAM openocd (temporary)
fpga_reverse_u16.menu.bitstream.sram.upload.bitstream.command={runtime.tools.openocd.path}/bin/openocd "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command={bootloader.openocd.command}" "--command=shutdown"
fpga_reverse_u16.menu.bitstream.sramquartus=SRAM quartus (temporary)
fpga_reverse_u16.menu.bitstream.sramquartus.upload.bitstream.command="quartus_pgm" "--no_banner" "--mode=jtag" "-o" "P;{bootloader.file.sof}"
fpga_reverse_u16.menu.bitstream.flashquartus=FLASH quartus (permanent)
fpga_reverse_u16.menu.bitstream.flashquartus.upload.bitstream.command="quartus_pgm" "--no_banner" "--mode=jtag" "-o" "IP;{bootloader.file.jic}"

#
# Altera TB276 Board (ebay), f32c SoC
#
fpga_tb276.name=TB276 (Altera Cyclone IV E EP4CE6, 16K BRAM, 81.25/112.5 MHz)
fpga_tb276.build.mcu=f32c
fpga_tb276.build.core=f32c
fpga_tb276.build.board=F32C_FPGA_TB276
fpga_tb276.build.soc_video_bpp=8
fpga_tb276.upload.tool=ujprog
fpga_tb276.upload.wait_for_upload_port=false
fpga_tb276.upload.native_usb=false
fpga_tb276.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/tb276.cfg
fpga_tb276.bootloader.file.svf={runtime.tools.bootloaders.path}/tb276/tb276_{cpu.arch}_{bitstream.fcpu.mhz}mhz.svf
fpga_tb276.bootloader.file.jic={runtime.tools.bootloaders.path}/tb276/tb276_{cpu.arch}_{bitstream.fcpu.mhz}mhz.jic
fpga_tb276.bootloader.file.sof={runtime.tools.bootloaders.path}/tb276/tb276_{cpu.arch}_{bitstream.fcpu.mhz}mhz.sof
fpga_tb276.bootloader.openocd.command=svf -tap chip.tap {{bootloader.file.svf}}
fpga_tb276.menu.cpu.mips=MIPS
fpga_tb276.menu.cpu.mips.cpu.arch=mips
fpga_tb276.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_tb276.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_tb276.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_tb276.menu.cpu.riscv=RISC-V
fpga_tb276.menu.cpu.riscv.cpu.arch=riscv
fpga_tb276.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_tb276.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_tb276.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_tb276.menu.ramsize.16=16 KB BRAM Internal
fpga_tb276.menu.ramsize.16.upload.maximum_size=14848
fpga_tb276.menu.ramsize.16.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_tb276.menu.speed.81=81.25 MHz
fpga_tb276.menu.speed.81.build.f_cpu=81250000
fpga_tb276.menu.speed.81.bitstream.fcpu.mhz=81
fpga_tb276.menu.speed.112=112.5 MHz
fpga_tb276.menu.speed.112.build.f_cpu=112500000
fpga_tb276.menu.speed.112.bitstream.fcpu.mhz=112
fpga_tb276.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_tb276.menu.protocol.bin.upload.protocol=bin
fpga_tb276.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_tb276.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_tb276.menu.protocol.hex.upload.protocol=hex
fpga_tb276.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_tb276.menu.pinmap.generic=Generic
fpga_tb276.menu.pinmap.generic.build.variant=generic
fpga_tb276.menu.jtag.alterablaster=Altera Blaster
fpga_tb276.menu.jtag.alterablaster.bootloader.openocd.interface={runtime.tools.openocd.path}/scripts/interface/altera-usb-blaster.cfg
fpga_tb276.menu.jtag.remotebitbang=Remote bitbang (TCP jtag:3335)
fpga_tb276.menu.jtag.remotebitbang.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/remote_bitbang.cfg
fpga_tb276.menu.jtag.fpu1=FT2232 PLDkit FPU1
fpga_tb276.menu.jtag.fpu1.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/fpu1.cfg
fpga_tb276.menu.bitstream.sram=SRAM openocd (temporary)
fpga_tb276.menu.bitstream.sram.upload.bitstream.command={runtime.tools.openocd.path}/bin/openocd "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command={bootloader.openocd.command}" "--command=shutdown"
fpga_tb276.menu.bitstream.sramquartus=SRAM quartus (temporary)
fpga_tb276.menu.bitstream.sramquartus.upload.bitstream.command="quartus_pgm" "--no_banner" "--mode=jtag" "-o" "P;{bootloader.file.sof}"
fpga_tb276.menu.bitstream.flashquartus=FLASH quartus (permanent)
fpga_tb276.menu.bitstream.flashquartus.upload.bitstream.command="quartus_pgm" "--no_banner" "--mode=jtag" "-o" "IPV;{bootloader.file.jic}"

