f32c/arduino/hardware/fpga/f32c/tools/boards-manager/boards.txt
#
# Xilinx ESA11 Artix-7 board (Emanuel Stiebler)
#
fpga_esa11_xram.name=ESA11 (Xilinx Artix-7 XC7A35I/XC7A102T, 128K BRAM, 100 MHz)
fpga_esa11_xram.build.mcu=f32c
fpga_esa11_xram.build.core=f32c
fpga_esa11_xram.build.board=F32C_FPGA_ESA11_{chip}_BRAM
fpga_esa11_xram.upload.tool=ujprog
fpga_esa11_xram.upload.wait_for_upload_port=false
fpga_esa11_xram.upload.native_usb=false
#fpga_esa11_xram.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/esa11_7a35i_ms6p.cfg
fpga_esa11_xram.bootloader.file.bit={runtime.tools.bootloaders.path}/esa11/esa11_{chip}_{memsupport}_{cpu.arch}_{socopt}_{bitstream.fcpu.mhz}mhz.bit
#fpga_esa11_xram.bootloader.jtag_spi_bridge.bit={runtime.tools.bootloaders.path}/esa11_7a35i/bscan_xc7a_fgg484_blink.bit
fpga_esa11_xram.bootloader.openocd.command=svf -tap chip.tap {{bootloader.file.svf}}
fpga_esa11_xram.menu.cpu.mips=MIPS
fpga_esa11_xram.menu.cpu.mips.cpu.arch=mips
fpga_esa11_xram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_esa11_xram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_esa11_xram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_esa11_xram.menu.cpu.riscv=RISC-V
fpga_esa11_xram.menu.cpu.riscv.cpu.arch=riscv
fpga_esa11_xram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_esa11_xram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_esa11_xram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_esa11_xram.menu.fpga.7a102t=7a102t
fpga_esa11_xram.menu.fpga.7a102t.chip=7a102t
fpga_esa11_xram.menu.fpga.7a35i=7a35i
fpga_esa11_xram.menu.fpga.7a35i.chip=7a35i
fpga_esa11_xram.menu.ramsize.256M=256 MB DDR3 External
fpga_esa11_xram.menu.ramsize.256M.upload.maximum_size=256000000
fpga_esa11_xram.menu.ramsize.256M.build.sdata.size=4096
fpga_esa11_xram.menu.ramsize.256M.compiler.ld.extra_flags=--section-start=.init=0x80000000
fpga_esa11_xram.menu.ramsize.256M.memsupport=ddr3
fpga_esa11_xram.menu.ramsize.128=128 KB BRAM Emulated external
fpga_esa11_xram.menu.ramsize.128.upload.maximum_size=129536
fpga_esa11_xram.menu.ramsize.128.build.sdata.size=4096
fpga_esa11_xram.menu.ramsize.128.compiler.ld.extra_flags=--section-start=.init=0x80000000
fpga_esa11_xram.menu.ramsize.128.memsupport=bram
fpga_esa11_xram.menu.ramsize.16=16 KB BRAM Internal
fpga_esa11_xram.menu.ramsize.16.upload.maximum_size=14848
fpga_esa11_xram.menu.ramsize.16.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_esa11_xram.menu.ramsize.16.memsupport=bram
fpga_esa11_xram.menu.soc.vgatxt80x30=text 80x30 bitmap 640x480
fpga_esa11_xram.menu.soc.vgatxt80x30.socopt=vgatxt80x30
fpga_esa11_xram.menu.soc.vgatxt80x30.build.soc_video_bpp=8
fpga_esa11_xram.menu.soc.vgatxt80x30.build.f_cpu=100000000
fpga_esa11_xram.menu.soc.vgatxt80x30.bitstream.fcpu.mhz=100
fpga_esa11_xram.menu.soc.vgatxt80x60=text 80x60 bitmap 640x480
fpga_esa11_xram.menu.soc.vgatxt80x60.socopt=vgatxt80x60
fpga_esa11_xram.menu.soc.vgatxt80x60.build.soc_video_bpp=8
fpga_esa11_xram.menu.soc.vgatxt80x60.build.f_cpu=100000000
fpga_esa11_xram.menu.soc.vgatxt80x60.bitstream.fcpu.mhz=100
fpga_esa11_xram.menu.soc.vgabit8bpp=bitmap 640x480 8bpp
fpga_esa11_xram.menu.soc.vgabit8bpp.socopt=vgabit8bpp
fpga_esa11_xram.menu.soc.vgabit8bpp.build.soc_video_bpp=8
fpga_esa11_xram.menu.soc.vgabit8bpp.build.f_cpu=100000000
fpga_esa11_xram.menu.soc.vgabit8bpp.bitstream.fcpu.mhz=100
fpga_esa11_xram.menu.soc.vgabit16bpp=bitmap 640x480 16bpp
fpga_esa11_xram.menu.soc.vgabit16bpp.socopt=vgabit16bpp
fpga_esa11_xram.menu.soc.vgabit16bpp.build.soc_video_bpp=16
fpga_esa11_xram.menu.soc.vgabit16bpp.build.f_cpu=100000000
fpga_esa11_xram.menu.soc.vgabit16bpp.bitstream.fcpu.mhz=100
fpga_esa11_xram.menu.soc.vgabit32bpp=bitmap 640x480 32bpp
fpga_esa11_xram.menu.soc.vgabit32bpp.socopt=vgabit32bpp
fpga_esa11_xram.menu.soc.vgabit32bpp.build.soc_video_bpp=32
fpga_esa11_xram.menu.soc.vgabit32bpp.build.f_cpu=100000000
fpga_esa11_xram.menu.soc.vgabit32bpp.bitstream.fcpu.mhz=100
fpga_esa11_xram.menu.soc.vgabit640x360_32bpp_vector=bitmap 640x360 32bpp Vector FPU
fpga_esa11_xram.menu.soc.vgabit640x360_32bpp_vector.socopt=vgabit640x360_32bpp_vector
fpga_esa11_xram.menu.soc.vgabit640x360_32bpp_vector.build.soc_video_bpp=32
fpga_esa11_xram.menu.soc.vgabit640x360_32bpp_vector.build.f_cpu=100000000
fpga_esa11_xram.menu.soc.vgabit640x360_32bpp_vector.bitstream.fcpu.mhz=100
fpga_esa11_xram.menu.soc.vgabit640x480_32bpp_vector=bitmap 640x480 32bpp Vector FPU
fpga_esa11_xram.menu.soc.vgabit640x480_32bpp_vector.socopt=vgabit640x480_32bpp_vector
fpga_esa11_xram.menu.soc.vgabit640x480_32bpp_vector.build.soc_video_bpp=32
fpga_esa11_xram.menu.soc.vgabit640x480_32bpp_vector.build.f_cpu=100000000
fpga_esa11_xram.menu.soc.vgabit640x480_32bpp_vector.bitstream.fcpu.mhz=100
fpga_esa11_xram.menu.soc.vgabit800x480_32bpp_vector=bitmap 800x480 32bpp Vector FPU
fpga_esa11_xram.menu.soc.vgabit800x480_32bpp_vector.socopt=vgabit800x480_32bpp_vector
fpga_esa11_xram.menu.soc.vgabit800x480_32bpp_vector.build.soc_video_bpp=32
fpga_esa11_xram.menu.soc.vgabit800x480_32bpp_vector.build.f_cpu=100000000
fpga_esa11_xram.menu.soc.vgabit800x480_32bpp_vector.bitstream.fcpu.mhz=100
fpga_esa11_xram.menu.soc.vgabit800x600_32bpp_vector=bitmap 800x600 32bpp Vector FPU
fpga_esa11_xram.menu.soc.vgabit800x600_32bpp_vector.socopt=vgabit800x600_32bpp_vector
fpga_esa11_xram.menu.soc.vgabit800x600_32bpp_vector.build.soc_video_bpp=32
fpga_esa11_xram.menu.soc.vgabit800x600_32bpp_vector.build.f_cpu=100000000
fpga_esa11_xram.menu.soc.vgabit800x600_32bpp_vector.bitstream.fcpu.mhz=100
fpga_esa11_xram.menu.soc.vgabit1024x576_32bpp_vector=bitmap 1024x576 32bpp Vector FPU
fpga_esa11_xram.menu.soc.vgabit1024x576_32bpp_vector.socopt=vgabit1024x576_32bpp_vector
fpga_esa11_xram.menu.soc.vgabit1024x576_32bpp_vector.build.soc_video_bpp=32
fpga_esa11_xram.menu.soc.vgabit1024x576_32bpp_vector.build.f_cpu=100000000
fpga_esa11_xram.menu.soc.vgabit1024x576_32bpp_vector.bitstream.fcpu.mhz=100
fpga_esa11_xram.menu.soc.vgabit1024x768_32bpp_vector=bitmap 1024x768 32bpp Vector FPU
fpga_esa11_xram.menu.soc.vgabit1024x768_32bpp_vector.socopt=vgabit1024x768_32bpp_vector
fpga_esa11_xram.menu.soc.vgabit1024x768_32bpp_vector.build.soc_video_bpp=32
fpga_esa11_xram.menu.soc.vgabit1024x768_32bpp_vector.build.f_cpu=108000000
fpga_esa11_xram.menu.soc.vgabit1024x768_32bpp_vector.bitstream.fcpu.mhz=108
fpga_esa11_xram.menu.soc.vgabit1280x1024_32bpp_vector=bitmap 1280x1024 32bpp Vector FPU
fpga_esa11_xram.menu.soc.vgabit1280x1024_32bpp_vector.socopt=vgabit1280x1024_32bpp_vector
fpga_esa11_xram.menu.soc.vgabit1280x1024_32bpp_vector.build.soc_video_bpp=32
fpga_esa11_xram.menu.soc.vgabit1280x1024_32bpp_vector.build.f_cpu=108000000
fpga_esa11_xram.menu.soc.vgabit1280x1024_32bpp_vector.bitstream.fcpu.mhz=108
fpga_esa11_xram.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_esa11_xram.menu.protocol.bin.upload.protocol=bin
fpga_esa11_xram.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_esa11_xram.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_esa11_xram.menu.protocol.hex.upload.protocol=hex
fpga_esa11_xram.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_esa11_xram.menu.pinmap.generic=Generic
fpga_esa11_xram.menu.pinmap.generic.build.variant=generic
fpga_esa11_xram.menu.pinmap.esa11=ESA11
fpga_esa11_xram.menu.pinmap.esa11.build.variant=esa11
fpga_esa11_xram.menu.jtag.ft4232=Onboard FT4232 JTAG
#fpga_esa11_xram.menu.jtag.ft4232.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/ft4232-generic.ocd
fpga_esa11_xram.menu.bitstream.sram_xc3sprog=SRAM xc3sprog (temporary)
fpga_esa11_xram.menu.bitstream.sram_xc3sprog.upload.bitstream.command="{runtime.tools.xc3sprog.path}/xc3sprog" -c ft4232h_fast "{bootloader.file.bit}"
fpga_esa11_xram.menu.bitstream.sram_xc3sprog.upload.bitstream.command.windows="{runtime.tools.xc3sprog.path}/xc3sprog.bat" -c ft4232h_fast "{bootloader.file.bit}"

#
# Basys-3
#
fpga_basys3_bram.name=Digilent Basys-3 (Xilinx Artix-7, 128K BRAM, 100 MHz)
fpga_basys3_bram.build.f_cpu=100000000
fpga_basys3_bram.build.variant=generic
fpga_basys3_bram.build.mcu=f32c
fpga_basys3_bram.build.core=f32c
fpga_basys3_bram.build.board=F32C_FPGA_BASYS3_BRAM
fpga_basys3_bram.build.soc_video_bpp=8
fpga_basys3_bram.upload.tool=ujprog
fpga_basys3_bram.upload.wait_for_upload_port=false
fpga_basys3_bram.upload.native_usb=false
fpga_basys3_bram.upload.maximum_size=129536
fpga_basys3_bram.upload.protocol=hex
fpga_basys3_bram.upload.flags=-P{serial.port} -ra
fpga_basys3_bram.menu.cpu.mips=MIPS
fpga_basys3_bram.menu.cpu.mips.cpu.arch=mips
fpga_basys3_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_basys3_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_basys3_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_basys3_bram.menu.cpu.riscv=RISC-V
fpga_basys3_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_basys3_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_basys3_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_basys3_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_basys3_bram.bootloader.file.svf={runtime.tools.bootloaders.path}/basys3/basys3_{cpu.arch}_{memsupport}_{socopt}_{bitstream.fcpu.mhz}mhz.svf
fpga_basys3_bram.bootloader.file.bit={runtime.tools.bootloaders.path}/basys3/basys3_{cpu.arch}_{memsupport}_{socopt}_{bitstream.fcpu.mhz}mhz.bit
fpga_basys3_bram.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/basys3.cfg
fpga_basys3_bram.bootloader.openocd.command=svf -tap chip.tap {{bootloader.file.svf}}
fpga_basys3_bram.bitstream.fcpu.mhz=100
fpga_basys3_bram.menu.jtag.basys3=BASYS3 onboard JTAG
fpga_basys3_bram.menu.jtag.basys3.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/digilent_adept.cfg
fpga_basys3_bram.menu.ramsize.128=128 KB BRAM Emulated external
fpga_basys3_bram.menu.ramsize.128.upload.maximum_size=129536
fpga_basys3_bram.menu.ramsize.128.build.sdata.size=4096
fpga_basys3_bram.menu.ramsize.128.compiler.ld.extra_flags=--section-start=.init=0x80000000
fpga_basys3_bram.menu.ramsize.128.memsupport=acram_emu
fpga_basys3_bram.menu.ramsize.16=16 KB BRAM Internal
fpga_basys3_bram.menu.ramsize.16.upload.maximum_size=14848
fpga_basys3_bram.menu.ramsize.16.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_basys3_bram.menu.ramsize.16.memsupport=bram
fpga_basys3_bram.menu.soc.minimal=Minimal
fpga_basys3_bram.menu.soc.minimal.socopt=minimal
fpga_basys3_bram.menu.soc.vector=Vector FPU
fpga_basys3_bram.menu.soc.vector.socopt=vector
fpga_basys3_bram.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_basys3_bram.menu.protocol.bin.upload.protocol=bin
fpga_basys3_bram.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_basys3_bram.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_basys3_bram.menu.protocol.hex.upload.protocol=hex
fpga_basys3_bram.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_basys3_bram.menu.bitstream.sram_xc3sprog=SRAM xc3sprog (temporary)
fpga_basys3_bram.menu.bitstream.sram_xc3sprog.upload.bitstream.command="{runtime.tools.xc3sprog.path}/xc3sprog" -c jtaghs1_fast -p 1 "{bootloader.file.bit}"
fpga_basys3_bram.menu.bitstream.sram_xc3sprog.upload.bitstream.command.windows="{runtime.tools.xc3sprog.path}/xc3sprog.bat" -c jtaghs1_fast -p 1 "{bootloader.file.bit}"
fpga_basys3_bram.menu.bitstream.sram_openocd=SRAM openocd (temporary)
fpga_basys3_bram.menu.bitstream.sram_openocd.upload.bitstream.command={runtime.tools.openocd.path}/bin/openocd "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command={bootloader.openocd.command}" "--command=shutdown"

#
# ZYBO
#
fpga_zybo_bram.name=Digilent ZYBO (Xilinx Zynq 7010, 128K BRAM, 100 MHz)
fpga_zybo_bram.build.f_cpu=100000000
fpga_zybo_bram.build.variant=generic
fpga_zybo_bram.build.mcu=f32c
fpga_zybo_bram.build.core=f32c
fpga_zybo_bram.build.board=F32C_FPGA_ZYBO_BRAM
fpga_zybo_bram.build.soc_video_bpp=8
fpga_zybo_bram.build.sdata.size=4096
fpga_zybo_bram.upload.tool=ujprog
fpga_zybo_bram.upload.wait_for_upload_port=false
fpga_zybo_bram.upload.native_usb=false
#fpga_zybo_bram.upload.maximum_size=129536
#fpga_zybo_bram.upload.bitstream.command={runtime.tools.openocd.path}/bin/openocd "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command={bootloader.openocd.command}" "--command=shutdown"
fpga_zybo_bram.bootloader.file.svf={runtime.tools.bootloaders.path}/zybo/zybo_{cpu.arch}_{memsupport}_{socopt}_{bitstream.fcpu.mhz}mhz.svf
fpga_zybo_bram.bootloader.file.bit={runtime.tools.bootloaders.path}/zybo/zybo_{cpu.arch}_{memsupport}_{socopt}_{bitstream.fcpu.mhz}mhz.bit
fpga_zybo_bram.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/zybo.cfg
fpga_zybo_bram.bootloader.openocd.command=svf -tap chip.tap {{bootloader.file.svf}}
fpga_zybo_bram.bitstream.fcpu.mhz=100
fpga_zybo_bram.menu.cpu.mips=MIPS
fpga_zybo_bram.menu.cpu.mips.cpu.arch=mips
fpga_zybo_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_zybo_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_zybo_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_zybo_bram.menu.cpu.riscv=RISC-V
fpga_zybo_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_zybo_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_zybo_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_zybo_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_zybo_bram.menu.jtag.zybo=ZYBO onboard JTAG
fpga_zybo_bram.menu.jtag.zybo.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/digilent_adept.cfg
fpga_zybo_bram.menu.jtag.fpu1=PLDkit FPU1 JTAG
fpga_zybo_bram.menu.jtag.fpu1.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/fpu1.cfg
fpga_zybo_bram.menu.ramsize.32M=32 MB DDR3 ZYNQ bypass
fpga_zybo_bram.menu.ramsize.32M.upload.maximum_size=32000000
fpga_zybo_bram.menu.ramsize.32M.build.sdata.size=4096
fpga_zybo_bram.menu.ramsize.32M.compiler.ld.extra_flags=--section-start=.init=0x80000000
fpga_zybo_bram.menu.ramsize.32M.memsupport=ddr3
fpga_zybo_bram.menu.ramsize.128=128 KB BRAM Emulated external
fpga_zybo_bram.menu.ramsize.128.upload.maximum_size=129536
fpga_zybo_bram.menu.ramsize.128.build.sdata.size=4096
fpga_zybo_bram.menu.ramsize.128.compiler.ld.extra_flags=--section-start=.init=0x80000000
fpga_zybo_bram.menu.ramsize.128.memsupport=acram_emu
fpga_zybo_bram.menu.ramsize.16=16 KB BRAM Internal
fpga_zybo_bram.menu.ramsize.16.upload.maximum_size=14848
fpga_zybo_bram.menu.ramsize.16.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_zybo_bram.menu.ramsize.16.memsupport=bram
fpga_zybo_bram.menu.soc.vgatxt80x30=text 80x30 bitmap 640x480
fpga_zybo_bram.menu.soc.vgatxt80x30.socopt=vgatxt80x30
fpga_zybo_bram.menu.soc.vgatxt80x60=text 80x60 bitmap 640x480
fpga_zybo_bram.menu.soc.vgatxt80x60.socopt=vgatxt80x60
fpga_zybo_bram.menu.soc.vgabit=Bitmap 640x480
fpga_zybo_bram.menu.soc.vgabit.socopt=vgabit640x480
fpga_zybo_bram.menu.soc.vector=Bitmat 640x480 Vector FPU
fpga_zybo_bram.menu.soc.vector.socopt=vgabit640x480_vector
fpga_zybo_bram.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_zybo_bram.menu.protocol.bin.upload.protocol=bin
fpga_zybo_bram.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_zybo_bram.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_zybo_bram.menu.protocol.hex.upload.protocol=hex
fpga_zybo_bram.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_zybo_bram.menu.bitstream.sram_xc3sprog=SRAM xc3sprog (temporary)
fpga_zybo_bram.menu.bitstream.sram_xc3sprog.upload.bitstream.command="{runtime.tools.xc3sprog.path}/xc3sprog" -c jtaghs1_fast -p 1 "{bootloader.file.bit}"
fpga_zybo_bram.menu.bitstream.sram_xc3sprog.upload.bitstream.command.windows="{runtime.tools.xc3sprog.path}/xc3sprog.bat" -c jtaghs1_fast -p 1 "{bootloader.file.bit}"
fpga_zybo_bram.menu.bitstream.sram_openocd=SRAM openocd (temporary)
fpga_zybo_bram.menu.bitstream.sram_openocd.upload.bitstream.command={runtime.tools.openocd.path}/bin/openocd "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command={bootloader.openocd.command}" "--command=shutdown"

