f32c/arduino/hardware/fpga/f32c/tools/boards-manager/boards.txt
#
# Xilinx Scarab Hardware miniSpartan6+ Board, f32c SoC
#
fpga_scarab_sdram.name=Scarab miniSpartan6+ (Xilinx Spartan-6 XC6SLX25, 64K BRAM, 81.25/112.5 MHz)
fpga_scarab_sdram.build.mcu=f32c
fpga_scarab_sdram.build.core=f32c
fpga_scarab_sdram.build.board=F32C_FPGA_SCARAB_BRAM
fpga_scarab_sdram.upload.tool=ujprog
fpga_scarab_sdram.upload.wait_for_upload_port=false
fpga_scarab_sdram.upload.native_usb=false
fpga_scarab_sdram.bootloader.openocd.board={runtime.platform.path}/tools/openocd/scripts/board/scarab_ms6p.cfg
fpga_scarab_sdram.bootloader.file.svf={runtime.tools.bootloaders.path}/scarab/scarab_{memsupport}_{chip}_{cpu.arch}_{socopt}_{bitstream.fcpu.mhz}mhz.svf
fpga_scarab_sdram.bootloader.file.bit={runtime.tools.bootloaders.path}/scarab/scarab_{memsupport}_{chip}_{cpu.arch}_{socopt}_{bitstream.fcpu.mhz}mhz.bit
fpga_scarab_sdram.bootloader.jtag_spi_bridge.bit={runtime.tools.bootloaders.path}/scarab/bscan_xc6s_ftg256_blink.bit
fpga_scarab_sdram.bootloader.openocd.command=svf -tap chip.tap {{bootloader.file.svf}}
fpga_scarab_sdram.menu.cpu.mips=MIPS
fpga_scarab_sdram.menu.cpu.mips.cpu.arch=mips
fpga_scarab_sdram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_scarab_sdram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_scarab_sdram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_scarab_sdram.menu.cpu.riscv=RISC-V
fpga_scarab_sdram.menu.cpu.riscv.cpu.arch=riscv
fpga_scarab_sdram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_scarab_sdram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_scarab_sdram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_scarab_sdram.menu.fpga.lx25=XC6SLX25
fpga_scarab_sdram.menu.fpga.lx25.chip=xc6slx25
fpga_scarab_sdram.menu.fpga.lx9=XC6SLX9
fpga_scarab_sdram.menu.fpga.lx9.chip=xc6slx9
fpga_scarab_sdram.menu.ramsize.32M=32 MB SDRAM Onboard
fpga_scarab_sdram.menu.ramsize.32M.upload.maximum_size=33521664
fpga_scarab_sdram.menu.ramsize.32M.build.sdata.size=4096
fpga_scarab_sdram.menu.ramsize.32M.compiler.ld.extra_flags=--section-start=.init=0x80000000
fpga_scarab_sdram.menu.ramsize.32M.memsupport=sdram
fpga_scarab_sdram.menu.ramsize.32K=32 KB BRAM Internal
fpga_scarab_sdram.menu.ramsize.32K.upload.maximum_size=31232
fpga_scarab_sdram.menu.ramsize.32K.build.sdata.size=32768
fpga_scarab_sdram.menu.ramsize.32K.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_scarab_sdram.menu.ramsize.32K.memsupport=bram
fpga_scarab_sdram.menu.soc.vgatxt80x30=text 80x30-8x16 640x480-8bpp 100 MHz
fpga_scarab_sdram.menu.soc.vgatxt80x30.socopt=vgatxt80x30
fpga_scarab_sdram.menu.soc.vgatxt80x30.build.soc_video_bpp=8
fpga_scarab_sdram.menu.soc.vgatxt80x30.build.f_cpu=100000000
fpga_scarab_sdram.menu.soc.vgatxt80x30.bitstream.fcpu.mhz=100
fpga_scarab_sdram.menu.soc.vgatxt80x60=text 80x60-8x8 640x480-8bpp 100 MHz
fpga_scarab_sdram.menu.soc.vgatxt80x60.socopt=vgatxt80x60
fpga_scarab_sdram.menu.soc.vgatxt80x60.build.soc_video_bpp=8
fpga_scarab_sdram.menu.soc.vgatxt80x60.build.f_cpu=100000000
fpga_scarab_sdram.menu.soc.vgatxt80x60.bitstream.fcpu.mhz=100
fpga_scarab_sdram.menu.soc.vgabit8bpp640x360_vector=640x360-8bpp 8-Vector FPU 100 MHz
fpga_scarab_sdram.menu.soc.vgabit8bpp640x360_vector.socopt=vgabit8bpp640x360_vector
fpga_scarab_sdram.menu.soc.vgabit8bpp640x360_vector.build.soc_video_bpp=8
fpga_scarab_sdram.menu.soc.vgabit8bpp640x360_vector.build.f_cpu=100000000
fpga_scarab_sdram.menu.soc.vgabit8bpp640x360_vector.bitstream.fcpu.mhz=100
fpga_scarab_sdram.menu.soc.vgabit8bpp640x480_4vector=640x480-8bpp 4-Vector FPU 100 MHz
fpga_scarab_sdram.menu.soc.vgabit8bpp640x480_4vector.socopt=vgabit8bpp640x480_4vector
fpga_scarab_sdram.menu.soc.vgabit8bpp640x480_4vector.build.soc_video_bpp=8
fpga_scarab_sdram.menu.soc.vgabit8bpp640x480_4vector.build.f_cpu=100000000
fpga_scarab_sdram.menu.soc.vgabit8bpp640x480_4vector.bitstream.fcpu.mhz=100
fpga_scarab_sdram.menu.soc.vgabit8bpp640x480_vector=640x480-8bpp 8-Vector FPU 100 MHz
fpga_scarab_sdram.menu.soc.vgabit8bpp640x480_vector.socopt=vgabit8bpp640x480_vector
fpga_scarab_sdram.menu.soc.vgabit8bpp640x480_vector.build.soc_video_bpp=8
fpga_scarab_sdram.menu.soc.vgabit8bpp640x480_vector.build.f_cpu=100000000
fpga_scarab_sdram.menu.soc.vgabit8bpp640x480_vector.bitstream.fcpu.mhz=100
fpga_scarab_sdram.menu.soc.vgabit8bpp800x480_vector=800x480-8bpp 8-Vector FPU 100 MHz
fpga_scarab_sdram.menu.soc.vgabit8bpp800x480_vector.socopt=vgabit8bpp800x480_vector
fpga_scarab_sdram.menu.soc.vgabit8bpp800x480_vector.build.soc_video_bpp=8
fpga_scarab_sdram.menu.soc.vgabit8bpp800x480_vector.build.f_cpu=100000000
fpga_scarab_sdram.menu.soc.vgabit8bpp800x480_vector.bitstream.fcpu.mhz=100
fpga_scarab_sdram.menu.soc.vgabit8bpp1024x576_vector=1024x576-8bpp 8-Vector FPU 100 MHz
fpga_scarab_sdram.menu.soc.vgabit8bpp1024x576_vector.socopt=vgabit8bpp1024x576_vector
fpga_scarab_sdram.menu.soc.vgabit8bpp1024x576_vector.build.soc_video_bpp=8
fpga_scarab_sdram.menu.soc.vgabit8bpp1024x576_vector.build.f_cpu=100000000
fpga_scarab_sdram.menu.soc.vgabit8bpp1024x576_vector.bitstream.fcpu.mhz=100
fpga_scarab_sdram.menu.soc.vgabit8bpp1024x768_vector=1024x768-8bpp 8-Vector FPU 98 MHz
fpga_scarab_sdram.menu.soc.vgabit8bpp1024x768_vector.socopt=vgabit8bpp1024x768_vector
fpga_scarab_sdram.menu.soc.vgabit8bpp1024x768_vector.build.soc_video_bpp=8
fpga_scarab_sdram.menu.soc.vgabit8bpp1024x768_vector.build.f_cpu=98000000
fpga_scarab_sdram.menu.soc.vgabit8bpp1024x768_vector.bitstream.fcpu.mhz=98
fpga_scarab_sdram.menu.soc.vgabit16bpp640x480_vector=640x480-16bpp 8-Vector FPU 100 MHz
fpga_scarab_sdram.menu.soc.vgabit16bpp640x480_vector.socopt=vgabit16bpp640x480_vector
fpga_scarab_sdram.menu.soc.vgabit16bpp640x480_vector.build.soc_video_bpp=16
fpga_scarab_sdram.menu.soc.vgabit16bpp640x480_vector.build.f_cpu=100000000
fpga_scarab_sdram.menu.soc.vgabit16bpp640x480_vector.bitstream.fcpu.mhz=100
fpga_scarab_sdram.menu.soc.vgabit8bpp640x480=640x480-8bpp 100 MHz
fpga_scarab_sdram.menu.soc.vgabit8bpp640x480.socopt=vgabit8bpp640x480
fpga_scarab_sdram.menu.soc.vgabit8bpp640x480.build.soc_video_bpp=8
fpga_scarab_sdram.menu.soc.vgabit8bpp640x480.build.f_cpu=100000000
fpga_scarab_sdram.menu.soc.vgabit8bpp640x480.bitstream.fcpu.mhz=100
fpga_scarab_sdram.menu.soc.vgabit16bpp640x480=640x480-16bpp 100 MHz
fpga_scarab_sdram.menu.soc.vgabit16bpp640x480.socopt=vgabit16bpp640x480
fpga_scarab_sdram.menu.soc.vgabit16bpp640x480.build.soc_video_bpp=16
fpga_scarab_sdram.menu.soc.vgabit16bpp640x480.build.f_cpu=100000000
fpga_scarab_sdram.menu.soc.vgabit16bpp640x480.bitstream.fcpu.mhz=100
fpga_scarab_sdram.menu.soc.vgabit32bpp640x480=640x480-32bpp 100 MHz
fpga_scarab_sdram.menu.soc.vgabit32bpp640x480.socopt=vgabit32bpp640x480
fpga_scarab_sdram.menu.soc.vgabit32bpp640x480.build.soc_video_bpp=32
fpga_scarab_sdram.menu.soc.vgabit32bpp640x480.build.f_cpu=100000000
fpga_scarab_sdram.menu.soc.vgabit32bpp640x480.bitstream.fcpu.mhz=100
#fpga_scarab_sdram.menu.speed.100=100 MHz
#fpga_scarab_sdram.menu.speed.100.build.f_cpu=100000000
#fpga_scarab_sdram.menu.speed.100.bitstream.fcpu.mhz=100
#fpga_scarab_sdram.menu.speed.83=83.33 MHz
#fpga_scarab_sdram.menu.speed.83.build.f_cpu=83333333
#fpga_scarab_sdram.menu.speed.83.bitstream.fcpu.mhz=83
fpga_scarab_sdram.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_scarab_sdram.menu.protocol.bin.upload.protocol=bin
fpga_scarab_sdram.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_scarab_sdram.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_scarab_sdram.menu.protocol.hex.upload.protocol=hex
fpga_scarab_sdram.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_scarab_sdram.menu.pinmap.generic=Generic
fpga_scarab_sdram.menu.pinmap.generic.build.variant=generic
fpga_scarab_sdram.menu.jtag.ft2232=Onboard FT2232 JTAG
fpga_scarab_sdram.menu.jtag.ft2232.bootloader.openocd.interface={runtime.platform.path}/tools/openocd/scripts/interface/ftdi/ft2232-generic.cfg
fpga_scarab_sdram.menu.bitstream.sram_xc3sprog=SRAM xc3sprog (temporary)
fpga_scarab_sdram.menu.bitstream.sram_xc3sprog.upload.bitstream.command="{runtime.tools.xc3sprog.path}/xc3sprog" -c ftdi_fast "{bootloader.file.bit}"
fpga_scarab_sdram.menu.bitstream.sram_xc3sprog.upload.bitstream.command.windows="{runtime.tools.xc3sprog.path}/xc3sprog.bat" -c ftdi_fast "{bootloader.file.bit}"
fpga_scarab_sdram.menu.bitstream.flash_xc3sprog=FLASH xc3sprog (permanent)
fpga_scarab_sdram.menu.bitstream.flash_xc3sprog.upload.bitstream.command="{runtime.tools.xc3sprog.path}/xc3sprog" -c ftdi_fast "-I{bootloader.jtag_spi_bridge.bit}" "{bootloader.file.bit}"
fpga_scarab_sdram.menu.bitstream.flash_xc3sprog.upload.bitstream.command.windows="{runtime.tools.xc3sprog.path}/xc3sprog.bat" -c ftdi_fast "-I{bootloader.jtag_spi_bridge.bit}" "{bootloader.file.bit}"
fpga_scarab_sdram.menu.bitstream.sram_openocd=SRAM openocd (temporary)
fpga_scarab_sdram.menu.bitstream.sram_openocd.upload.bitstream.command={runtime.tools.openocd.path}/bin/openocd "--file={bootloader.openocd.interface}" "--file={bootloader.openocd.board}" "--command={bootloader.openocd.command}" "--command=shutdown"

#
# Xilinx Numato Mimas V2 Spartan-6
#
fpga_numato_mimasv2_bram.name=MimasV2 (Xilinx Spartan-6 XC6SLX9, 32K BRAM, 100 MHz)
fpga_numato_mimasv2_bram.build.mcu=f32c
fpga_numato_mimasv2_bram.build.core=f32c
fpga_numato_mimasv2_bram.build.board=F32C_FPGA_MIMASV2_BRAM
fpga_numato_mimasv2_bram.build.soc_video_bpp=8
fpga_numato_mimasv2_bram.upload.tool=ujprog
fpga_numato_mimasv2_bram.upload.wait_for_upload_port=false
fpga_numato_mimasv2_bram.upload.native_usb=false
fpga_numato_mimasv2_bram.upload.bitstream.command=python3 "{runtime.tools.numato.path}/MimasV2Config.py" "{serial.port}" "{bootloader.file.bin}"
fpga_numato_mimasv2_bram.bootloader.file.bin={runtime.tools.bootloaders.path}/numato_mimas_v2/numato_mimasv2_bram_{cpu.arch}_hdmi_{bitstream.fcpu.mhz}mhz.bin
fpga_numato_mimasv2_bram.menu.cpu.mips=MIPS
fpga_numato_mimasv2_bram.menu.cpu.mips.cpu.arch=mips
fpga_numato_mimasv2_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_numato_mimasv2_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_numato_mimasv2_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_numato_mimasv2_bram.menu.cpu.riscv=RISC-V
fpga_numato_mimasv2_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_numato_mimasv2_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_numato_mimasv2_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_numato_mimasv2_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_numato_mimasv2_bram.menu.ramsize.32=32 KB BRAM Internal
fpga_numato_mimasv2_bram.menu.ramsize.32.upload.maximum_size=31232
fpga_numato_mimasv2_bram.menu.ramsize.32.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_numato_mimasv2_bram.menu.speed.100=100 MHz
fpga_numato_mimasv2_bram.menu.speed.100.build.f_cpu=100000000
fpga_numato_mimasv2_bram.menu.speed.100.bitstream.fcpu.mhz=100
fpga_numato_mimasv2_bram.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_numato_mimasv2_bram.menu.protocol.hex.upload.protocol=hex
fpga_numato_mimasv2_bram.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_numato_mimasv2_bram.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_numato_mimasv2_bram.menu.protocol.bin.upload.protocol=bin
fpga_numato_mimasv2_bram.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_numato_mimasv2_bram.menu.pinmap.generic=Generic
fpga_numato_mimasv2_bram.menu.pinmap.generic.build.variant=generic

#
# E2LP
#
fpga_e2lp_bram.name=E2LP (Xilinx Spartan-6, 128K BRAM, 80 MHz)
fpga_e2lp_bram.build.f_cpu=80000000
fpga_e2lp_bram.build.variant=generic
fpga_e2lp_bram.build.mcu=f32c
fpga_e2lp_bram.build.core=f32c
fpga_e2lp_bram.build.board=F32C_FPGA_E2LP_BRAM
fpga_e2lp_bram.build.soc_video_bpp=8
fpga_e2lp_bram.upload.tool=ujprog
fpga_e2lp_bram.upload.wait_for_upload_port=false
fpga_e2lp_bram.upload.native_usb=false
fpga_e2lp_bram.upload.maximum_size=129536
fpga_e2lp_bram.upload.protocol=hex
fpga_e2lp_bram.upload.flags=-P{serial.port} -ra
fpga_e2lp_bram.menu.cpu.mips=MIPS
fpga_e2lp_bram.menu.cpu.mips.cpu.arch=mips
fpga_e2lp_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_e2lp_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_e2lp_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_e2lp_bram.menu.cpu.riscv=RISC-V
fpga_e2lp_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_e2lp_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_e2lp_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_e2lp_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}

#
# Nexys-3
#
fpga_nexys3_bram.name=Digilent Nexys-3 (Xilinx Spartan-6, 32K BRAM, 80 MHz)
fpga_nexys3_bram.build.f_cpu=80000000
fpga_nexys3_bram.build.variant=generic
fpga_nexys3_bram.build.mcu=f32c
fpga_nexys3_bram.build.core=f32c
fpga_nexys3_bram.build.board=F32C_FPGA_NEXYS3_BRAM
fpga_nexys3_bram.build.soc_video_bpp=8
fpga_nexys3_bram.upload.tool=ujprog
fpga_nexys3_bram.upload.wait_for_upload_port=false
fpga_nexys3_bram.upload.native_usb=false
fpga_nexys3_bram.upload.maximum_size=31232
fpga_nexys3_bram.upload.protocol=hex
fpga_nexys3_bram.upload.flags=-P{serial.port} -ra
fpga_nexys3_bram.menu.cpu.mips=MIPS
fpga_nexys3_bram.menu.cpu.mips.cpu.arch=mips
fpga_nexys3_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_nexys3_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_nexys3_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_nexys3_bram.menu.cpu.riscv=RISC-V
fpga_nexys3_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_nexys3_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_nexys3_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_nexys3_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}

#
# Xilinx Posedge-One Spartan-6
#
fpga_Posedge_One_bram.name=Posedge-One (Xilinx Spartan-6 XC6SLX9, 32K BRAM, 100 MHz)
fpga_Posedge_One_bram.build.mcu=f32c
fpga_Posedge_One_bram.build.core=f32c
fpga_Posedge_One_bram.build.board=F32C_FPGA_POSEDGEONE_BRAM
fpga_Posedge_One_bram.build.soc_video_bpp=8
fpga_Posedge_One_bram.upload.tool=ujprog
fpga_Posedge_One_bram.upload.wait_for_upload_port=false
fpga_Posedge_One_bram.upload.native_usb=false
fpga_Posedge_One_bram.menu.cpu.mips=MIPS
fpga_Posedge_One_bram.menu.cpu.mips.cpu.arch=mips
fpga_Posedge_One_bram.menu.cpu.mips.compiler.c.flags={f32c.mips.compiler.c.flags}
fpga_Posedge_One_bram.menu.cpu.mips.compiler.cpp.flags={f32c.mips.compiler.cpp.flags}
fpga_Posedge_One_bram.menu.cpu.mips.compiler.ld.flags={f32c.mips.compiler.ld.flags}
fpga_Posedge_One_bram.menu.cpu.riscv=RISC-V
fpga_Posedge_One_bram.menu.cpu.riscv.cpu.arch=riscv
fpga_Posedge_One_bram.menu.cpu.riscv.compiler.c.flags={f32c.riscv.compiler.c.flags}
fpga_Posedge_One_bram.menu.cpu.riscv.compiler.cpp.flags={f32c.riscv.compiler.cpp.flags}
fpga_Posedge_One_bram.menu.cpu.riscv.compiler.ld.flags={f32c.riscv.compiler.ld.flags}
fpga_Posedge_One_bram.menu.ramsize.32=32 KB BRAM Internal
fpga_Posedge_One_bram.menu.ramsize.32.upload.maximum_size=31232
fpga_Posedge_One_bram.menu.ramsize.32.compiler.ld.extra_flags=--section-start=.init=0x400
fpga_Posedge_One_bram.menu.speed.100=100 MHz
fpga_Posedge_One_bram.menu.speed.100.build.f_cpu=100000000
fpga_Posedge_One_bram.menu.speed.100.bitstream.fcpu.mhz=100
fpga_Posedge_One_bram.menu.soc.normal=Normal (24 GPIO, SPI, FM/RDS, VGA_text)
fpga_Posedge_One_bram.menu.soc.normal.socopt=normal
fpga_Posedge_One_bram.menu.soc.logix1=logix1 (logix1 megawing peripherals)
fpga_Posedge_One_bram.menu.soc.logix1.socopt=logix1
fpga_Posedge_One_bram.menu.protocol.bin=Binary 115.2 kbit/s CRC RS232
fpga_Posedge_One_bram.menu.protocol.bin.upload.protocol=bin
fpga_Posedge_One_bram.menu.protocol.bin.upload.flags=-P{serial.port} -re
fpga_Posedge_One_bram.menu.protocol.hex=Hex 115.2 kbit/s no verify RS232
fpga_Posedge_One_bram.menu.protocol.hex.upload.protocol=hex
fpga_Posedge_One_bram.menu.protocol.hex.upload.flags=-P{serial.port} -ra
fpga_Posedge_One_bram.menu.pinmap.generic=Generic
fpga_Posedge_One_bram.menu.pinmap.generic.build.variant=generic
fpga_Posedge_One_bram.upload.bitstream.command="{runtime.tools.xc3sprog.path}/xc3sprog" -c ftdi_fast "{bootloader.file.bit}"
fpga_Posedge_One_bram.upload.bitstream.command.windows="{runtime.tools.xc3sprog.path}/xc3sprog.bat" -L -c ftdi_fast "{bootloader.file.bit}"
fpga_Posedge_One_bram.bootloader.file.bit={runtime.tools.bootloaders.path}/posedge1/posedgeone_bram_{socopt}_{cpu.arch}_{bitstream.fcpu.mhz}mhz.bit

